
export const OP1 = [
  { value: 'Computer', label: 'Computer' },
  { value: 'Air conditioner', label: 'Air conditioner' },
  { value: 'Refrigerator', label: 'Refrigerator' },
  { value: 'Fan', label: 'Fan' },
  { value: 'Water heater', label: 'Water heater' },
  { value: 'Laptop', label: 'Laptop' },
  { value: 'Microwave', label: 'Microwave' },
  { value: 'Phone', label: 'Phone' },
  { value: 'Tablet', label: 'Tablet' },
  { value: 'Guitar', label: 'Guitar' },
  { value: 'Monitor', label: 'Monitor' },
  { value: 'Television', label: 'Television' },
  { value: 'Printer', label: 'Printer' },
  { value: 'Vacuum cleaner', label: 'Vacuum cleaner' },
  { value: 'Water system', label: 'Water system' }
];

export const major = [
  '1.สำนักวิชาวิทยาศาสตร์',
  'สาขาวิชาเคมี',
  'สาขาวิชาคณิตศาสตร์',
  'สาขาวิชาชีววิทยา',
  'สำนักวิชาเทคโนโลสาขาวิชาฟิสิกส์ยีสังคม',
  'สาขาวิชาการรับรู้จากระยะไกล',
  'สาขาวิชาวิทยาศาสตร์การกีฬา',
  'สาขาวิชาเทคโนโลยีเลเซอร์และโฟตอนนิกส์',
  '2.สำนักวิชาวิศวกรรมศาสตร์',
  'สาขาวิชาวิศวกรรมเกษตรและอาหาร',
  'สาขาวิชาวิศวกรรมขนส่งและโลจิสติกส์',
  'สาขาวิชาวิศวกรรมคอมพิวเตอร์',
  'สาขาวิชาวิศวกรรมเคมี',
  'สาขาวิชาวิศวกรรมเซรามิก',
  'สาขาวิชาวิศวกรรมโทรคมนาคม',
  'สาขาวิชาวิศวกรรมพอลิเมอร์',
  'สาขาวิชาวิศวกรรมไฟฟ้า',
  'สาขาวิชาวิศวกรรมโยธา',
  'สาขาวิชาวิศวกรรมโลหการ',
  'สาขาวิชาวิศวกรรมสิ่งแวดล้อม',
  'สาขาวิชาวิศวกรรมอุตสาหการ',
  'สาขาวิชาวิศกรรมปิโตรเลียมและเทคโนโลยีธรณี',
  'สาขาวิชาวิศวกรรมธรณี',
  'สาขาวิชาวิศวกรรมอิเล็กทรอนิกส์',
  'สาขาวิชาวิศวกรรมออกแบบผลิตภัณฑ์',
  'สาขาวิชาวิศวกรรมเครื่องมือ',
  'หลักสูตรสหวิทยาการ',
  '3.สำนักวิชาแพทยศาสตร์',
  'สาขาวิชาแพทยศาสตร์',
  '4.สำนักวิชาพยาบาลศาสตร์',
  'สำนักวิชาพยาบาลศาสตร์',
  '5.สำนักวิชาเทคโนโลยีสังคม',
  'สาขาวิชาอังกฤษ',
  'สาขาวิชาเทคโนโลยีการจัดการ',
  'สาขาวิชาเทคโนโลยีสารสนเทศ',
  '6.สำนักวิชาเทคโนโลยีการเกษตร',
  'สาขาวิชาเทคโนโลยีการผลิตพืช',
  'สาขาวิชาเทคโนโลยีการผลิตสัตว์',
  'สาขาวิสาขาวิชาเทคโนโลยีชีวภาพชาเคมี',
  'สาขาวิชาเทคโนโลยีอาหาร',
  '7.สำนักวิชาทันตแพทยศาสตร์',
  'สำนักวิชาทันตแพทยศาสตร์',
  '8.สำนักวิชาสาธารณสุขศาสตร์',
  'สาขาวิชาอนามัยสิ่งแวดล้อม',
  'สาขาวิชาอาชีวอนามัยและความปลอดภัย',
  'สาขาวิชาโภชนวิทยาและการกำหนดอาหาร',
];

export const options0 = [
  { value: "สาขาวิชาเคมี", label: "สาขาวิชาเคมี" },
  { value: "สาขาวิชาคณิตศาสตร์", label: "สาขาวิชาคณิตศาสตร์" },
  { value: "สาขาวิชาชีววิทยา", label: "สาขาวิชาชีววิทยา" },
  { value: "สำนักวิชาเทคโนโลสาขาวิชาฟิสิกส์ยีสังคม", label: "สาขาวิชาฟิสิกส์" },
  { value: "สาขาวิชาการรับรู้จากระยะไกล", label: "สาขาวิชาการรับรู้จากระยะไกล" },
  { value: "สาขาวิชาวิทยาศาสตร์การกีฬา", label: "สาขาวิชาวิทยาศาสตร์การกีฬา" },
  { value: "สาขาวิชาเทคโนโลยีเลเซอร์และโฟตอนนิกส์", label: "สาขาวิชาเทคโนโลยีเลเซอร์และโฟตอนนิกส์" }
];

export const options1 = [
  { value: "สาขาวิชาวิศวกรรมเกษตรและอาหาร", label: "สาขาวิชาวิศวกรรมเกษตรและอาหาร" },
  { value: "สาขาวิชาวิศวกรรมขนส่งและโลจิสติกส์", label: "สาขาวิชาวิศวกรรมขนส่งและโลจิสติกส์" },
  { value: "สาขาวิชาวิศวกรรมคอมพิวเตอร์", label: "สาขาวิชาวิศวกรรมคอมพิวเตอร์" },
  { value: "สาขาวิชาวิศวกรรมเคมี", label: "สาขาวิชาวิศวกรรมเคมี" },
  { value: "สาขาวิชาวิศวกรรมเซรามิก", label: "สาขาวิชาวิศวกรรมเซรามิก" },
  { value: "สาขาวิชาวิศวกรรมโทรคมนาคม", label: "สาขาวิชาวิศวกรรมโทรคมนาคม" },
  { value: "สาขาวิชาวิศวกรรมพอลิเมอร์", label: "สาขาวิชาวิศวกรรมพอลิเมอร์" },
  { value: "สาขาวิชาวิศวกรรมไฟฟ้า", label: "สาขาวิชาวิศวกรรมไฟฟ้า" },
  { value: "สาขาวิชาวิศวกรรมโยธา", label: "สาขาวิชาวิศวกรรมโยธา" },
  { value: "สาขาวิชาวิศวกรรมโลหการ", label: "สาขาวิชาวิศวกรรมโลหการ" },
  { value: "สาขาวิชาวิศวกรรมสิ่งแวดล้อม", label: "สาขาวิชาวิศวกรรมสิ่งแวดล้อม" },
  { value: "สาขาวิชาวิศวกรรมอุตสาหการ", label: "สาขาวิชาวิศวกรรมอุตสาหการ" },
  { value: "สาขาวิชาวิศกรรมปิโตรเลียมและเทคโนโลยีธรณี", label: "สาขาวิชาวิศกรรมปิโตรเลียมและเทคโนโลยีธรณี" },
  { value: "สาขาวิชาวิศวกรรมธรณี", label: "สาขาวิชาวิศวกรรมธรณี" },
  { value: "สาขาวิชาวิศวกรรมอิเล็กทรอนิกส์", label: "สาขาวิชาวิศวกรรมอิเล็กทรอนิกส์" },
  { value: "สาขาวิชาวิศวกรรมออกแบบผลิตภัณฑ์", label: "สาขาวิชาวิศวกรรมออกแบบผลิตภัณฑ์" },
  { value: "สาขาวิชาวิศวกรรมเครื่องมือ", label: "สาขาวิชาวิศวกรรมเครื่องมือ" },
  { value: "หลักสูตรสหวิทยาการ", label: "หลักสูตรสหวิทยาการ" }
];

export const options2 = [
  { value: "สาขาวิชาแพทยศาสตร์", label: "สาขาวิชาแพทยศาสตร์" }
];

export const options3 = [
  { value: "สำนักวิชาพยาบาลศาสตร์", label: "สำนักวิชาพยาบาลศาสตร์" }
];

export const options4 = [
  { value: "สาขาวิชาอังกฤษ", label: "สาขาวิชาอังกฤษ" },
  { value: "สาขาวิชาเทคโนโลยีการจัดการ", label: "สาขาวิชาเทคโนโลยีการจัดการ" },
  { value: "สาขาวิชาเทคโนโลยีสารสนเทศ", label: "สาขาวิชาเทคโนโลยีสารสนเทศ" }
];

export const options5 = [
  { value: "สาขาวิชาเทคโนโลยีการผลิตพืช", label: "สาขาวิชาเทคโนโลยีการผลิตพืช" },
  { value: "สาขาวิชาเทคโนโลยีการผลิตสัตว์", label: "สาขาวิชาเทคโนโลยีการผลิตสัตว์" },
  { value: "สาขาวิชาเทคโนโลยีชีวภาพ", label: "สาขาวิชาเทคโนโลยีชีวภาพ" },
  { value: "สาขาวิชาเทคโนโลยีอาหาร", label: "สาขาวิชาเทคโนโลยีอาหาร" }
];

export const options6 = [
  { value: "สำนักวิชาทันตแพทยศาสตร์", label: "สำนักวิชาทันตแพทยศาสตร์" }
];

export const options7 = [
  { value: "สาขาวิชาอนามัยสิ่งแวดล้อม", label: "สาขาวิชาอนามัยสิ่งแวดล้อม" },
  { value: "สาขาวิชาอาชีวอนามัยและความปลอดภัย", label: "สาขาวิชาอาชีวอนามัยและความปลอดภัย" },
  { value: "สาขาวิชาโภชนวิทยาและการกำหนดอาหาร", label: "สาขาวิชาโภชนวิทยาและการกำหนดอาหาร" }
];

export const groupedOptions = [
  { label: "สำนักวิชาวิทยาศาสตร์", options: options0 },
  { label: "สำนักวิชาวิศวกรรมศาสตร์", options: options1 },
  { label: "สำนักวิชาแพทยศาสตร์", options: options2 },
  { label: "สำนักวิชาพยาบาลศาสตร์", options: options3 },
  { label: "สำนักวิชาเทคโนโลยีสังคม", options: options4 },
  { label: "สำนักวิชาเทคโนโลยีการเกษตร", options: options5 },
  { label: "สำนักวิชาทันตแพทยศาสตร์", options: options6 },
  { label: "สำนักวิชาสาธารณสุขศาสตร์", options: options7 }
];
